<?php

//-------------------- 服务器信息 --------------------
$server = '127.0.0.1';			//数据库地址
$dbuser = 'game';						//数据库用户名
$dbpass = 'uu5!^%jg';					//数据库密码


//--------------------- 公告地址 ---------------------
$gamename = 'http://skypub.gitee.io/client';

//--------------------- 游戏公告 ---------------------
$gamenews = '
尊敬的DNF用户：
      为了给各位勇士带来更优质的游戏体验，进一步加强游戏的安全性，我们将于11月29日(周四)05:30-9:00对所有大区进行停机维护，整个维护过程预计需要3.5个小时，因开机顺序以及数据维护内容差异，部分大区会提前开放。因停机给大家带来的不便，我们深表歉意。

停机时间：11月29日(周四)05:30-09:00
更新大区：所有大区
 
【更新内容】：
     探索神秘地下城，拿卢克材料   查看详情》
　　 贝奇的欢乐刮刮卡，刮奖赢大礼   查看详情》
　 　时光之约，我与NPC有个约定   查看详情》
　 　打团额外翻牌，传说装备免费租赁    查看详情》
　 　黄金增幅书降临，藏獒魔盒温暖严冬    查看详情》
';

//--------------------- 功能开关 ---------------------
$maint = 'open';		//游戏运行状态 --open表示正常 --close表示维护
$check = 'close';		//更新检测开关（客户端&PVF)
$G = '1';		//外挂检测开关0关1开
$regst = 'open';		//注册帐号开关*
$modfy = 'open';		//修改密码开关*
$backe = 'close';		//密码找回开关*
$cdkex = 'open';		//CDK 兑换开关
//open为打开相应功能，close为关闭相应功能，带*项表示为其他参数时不打开功能界面而跳转到指定网页


//-------------------- 自定义链接 --------------------
$gamehome = 'http://skypub.gitee.io/client';	//游戏官网
$recharge = 'http://skypub.gitee.io/client';		//充值地址
$serviceq = '4026311';				//在线客服QQ
$supportq = '4026311';				//技术支持QQ
$regstUrl = 'www.baidu.com';		//游戏注册地址
$modfyUrl = 'www.baidu.com';		//修改密码地址
$backeUrl = 'www.baidu.com';		//密码找回地址

//--------------------- 注册更新 ---------------------
$inituid = '1';		//注册起始uid，不超过8位数
$regdb = '0';		//注册赠送D币数量
$regdd = '200';		//注册赠送D点数量
$pvfId = '85205B2929340A7A0B82DDE1079D9A44063039A2';	//PVF效验值（SHA1算法）
$pvfUrl = 'https://pan.baidu.com/s/11xRvXxwRH68VWGIGHIOTEA';			//PVF更新地址
$dlqId = 'CA68A1EBBB438604BA8823CC37935B96F0597696';	//登录器效验值（SHA1算法）
$dlqUrl = 'https://pan.baidu.com/s/11xRvXxwRH68VWGIGHIOTEA';			//登录器更新地址

//--------------------- 外挂检测 ---------------------
$caplist = '私服通用*超级属性*夜光*3S评分*人物基址*起始偏移*顺图*物品入包*一键修改*一键完成*代码遍历工具*dnffz*秒天秒地*--加载--辅助*私服路径*巅峰*跳过登陆器*51328545*加载XP.W7 32位等驱动*DNF依恋*Cheat*首次扫描*请将鼠标移动到游戏窗口上*呼出仓库*鬼才辅助*图灵辅助*dnf超神tSrv.exe*一键任务*MD5修改工具*读取任务列表*王八深渊*3331,3331*进程ID：*窗口标题：*基本功能*方向键过图*保留不卖的材料*已开启高伤害*全屏吸怪*遍历任务*全屏攻击*全屏秒怪*加载驱动*全屏吸物*Alt+1*防止检测*一键分解';
//说明：caplist为检测关键字，格式：'关键字1*关键字2*关键字3' ，以*进行分割，可自行补充。

?>
